In [2]:
import pandas as pd
import numpy as np
import re
from matplotlib import pyplot as plt
import itertools
plt.style.use('ggplot')

In [3]:
alldata = pd.read_csv('alldata.csv')

In [4]:
alldata.head(10)

,position,company,description,reviews,location
0,Development Director,ALS TDI,Development Director\nALS Therapy Development ...,NaN,"Atlanta, GA 30301"
1,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Job Description\n\n""The road that leads to acc...",NaN,"Atlanta, GA"
2,Data Scientist,Xpert Staffing,"Growing company located in the Atlanta, GA are...",NaN,"Atlanta, GA"
3,Data Analyst,Operation HOPE,DEPARTMENT: Program OperationsPOSITION LOCATIO...,44.0,"Atlanta, GA 30303"
4,Assistant Professor -TT - Signal Processing & ...,Emory University,DESCRIPTION\nThe Emory University Department o...,550.0,"Atlanta, GA"
5,Manager of Data Engineering,McKinsey & Company,Qualifications\nBachelor’s degree in Computer ...,385.0,"Atlanta, GA 30318"
6,"Product Specialist - Periscope, New Ventures",McKinsey & Company,Qualifications\nBachelor’s degree\n5-7 years o...,385.0,"Atlanta, GA 30318"
7,"Junior to Mid-level Engineer, Geologist or Env...",Wood,Overview / Responsibilities\nWood Environment ...,899.0,"Atlanta, GA"
8,Analyst - CIB Credit Research,SunTrust,Works closely with senior CIB professionals. P...,3343.0,"Atlanta, GA"
9,Senior Associate - Cognitive Data Scientist Na...,KPMG,Known for being a great place to work and buil...,4494.0,"Atlanta, GA 30338"

In [5]:
# Null values

alldata['reviews'] = alldata['reviews'].fillna(0) #replace null values with 0.
alldata = alldata.dropna(axis=0, how = 'any') #remove rows with all null values

In [6]:
sum(alldata.isnull().any(axis=1)) # check if the removal of null's is successful

0

In [7]:
alldata.describe()

             reviews
count    6953.000000
mean     2435.183230
std      7515.618364
min         0.000000
25%         2.000000
50%        82.000000
75%       705.000000
max    148114.000000

In [8]:
alldata.dtypes

position        object
company         object
description     object
reviews        float64
location        object
dtype: object

In [9]:
alldata['position'].describe()

count               6953
unique              5242
top       Data Scientist
freq                 351
Name: position, dtype: object

In [10]:
alldata['description'].describe()

count                                                  6953
unique                                                 6708
top       Note: By applying to this position your applic...
freq                                                      9
Name: description, dtype: object

In [13]:
alldata['position'].value_counts()

Data Scientist                                 351
Senior Data Scientist                           96
Research Analyst                                64
Data Engineer                                   60
Machine Learning Engineer                       56
                                              ...
Associate Scientist - Informatics                1
Data Scientist / Engineer                        1
Senior Scientist, Biomolecular Interactions      1
Information Retrieval and NLP Scientist          1
SQL DBA                                          1
Name: position, Length: 5242, dtype: int64

In [12]:
alldata['company'].value_counts()

Amazon.com                 358
Ball Aerospace             187
Microsoft                  137
Google                     134
NYU Langone Health          77
                          ...
Organic                      1
Heliotrope Technologies      1
Enquero, Inc                 1
The Clorox Company           1
Wholefoods                   1
Name: company, Length: 2213, dtype: int64